# Домашняя работа курса С#
## Задача 1:
using static Library;

Напишите программу, которая выводит массив из N элементов,
заполненный нулями и единицами в случайном порядке.
Самое левое число != 0
Данный массив есть двоичное представление десятичного числа
[1,0,1,1,0,1,0,0]
Реализовать перевод двоичного числа в десятичное

1. Ввод N
int <- (string)

2. Создание массива
int[] <- (int)

3. Заполнение массива 0 и 1
void <- (int[])

4. Печать массива
string <- (int[])

5. Конвертация из 2-ого в 10-ое
int <- (int[])

6. 10110100 >> 180
string <- (int[] , int)
string GoodPrint(int[] bin, int dec)
{
return $"{String.Join("", bin)} >> {dec}";
}

Console.WriteLine(GoodPrint(new int[] { 1, 0, 1, 1, 1, 1, 0 }, 56));

 
[Код](Task_1/Program.cs)


## Задача 2: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
ДОПОЛНИТЕЛЬНАЯ ПОЛНЫЙ ЦИКЛ РЕШЕНИЯ С РАЗБИВКОЙ НА МЕТОДЫ КАК В ПРЕДЫДУЩЕЙ ЗАДАЧЕ

* 452 -> 11

* 82 -> 10

* 9012 -> 12

[Код](Task_2/Program.cs)

